Revit 2024 API
BuiltInFailures.SiteFailures.PointNotInSurface Property
 A Point is outside of the Surface boundary. Insert the Point on the boundary instead, and then drag it to the desired location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PointNotInSurface { get; }
Visual Basic
Public Shared ReadOnly Property PointNotInSurface As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PointNotInSurface {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace